app/Http/Controllers/EventsController.php

select * from `events` where `events`.`deleted_at` is null order by `date` desc limit 50
---
    public function index()
    {
        $eventsList = Events::orderBy('date', 'desc')->take(50)->get();

update `events` set `deleted_at` = '2021-12-09 15:46:47', `events`.`updated_at` = '2021-12-09 15:46:47' where `id` = 4
---
    public function destroy($id)
    {
        $events = Events::findOrFail($id);
        $events->delete();