app/Http/Controllers/MembreController.php

    public function store(Request $request)
    {

        $validated=$request->validate([
            'nom'=>['required', 'max:100'],
            'prenom'=>['required', 'max:100'],
            'mail'=>['required', 'max:100'],
            'jeupref'=>['required', 'max:100'],
            'description'=>['required'],
            'datenaissance'=>['required', 'date']
        ]);

        $events = Events::findOrFail($request->input('events_id'));
        $members = Membre::create($request->input());
        $members->events()->associate($events);
        $members->save();
        $members ->user()->associate(Auth::id());
        $members->save();
---
update `membres` set `events_id` = 19, `membres`.`updated_at` = '2021-12-08 14:07:11' where `id` = 21
update `membres` set `user_id` = 29, `membres`.`updated_at` = '2021-12-08 14:07:11' where `id` = 21