app/Http/Controllers/UsersGestionController.php

select * from `users` where `users`.`deleted_at` is null order by `id_role` asc limit 50
---
    public function index()
    {
        $usersList = User::orderBy('id_role', 'desc')->take(50)->get();

delete from `users` where `id` = 2
---
    public function destroy($id)
    {
        $users = User::findOrFail($id);
        $users->delete();